Tekla Open API Reference for Tekla Structures 2025
ModelViewEnumerator Methods
The ModelViewEnumerator type exposes the following members.
Methods
Name | Description
MoveNext
Moves to the next view in the enumerator.
Reset
Resets the enumerator.
Top
See Also
Reference
ModelViewEnumerator Class
Tekla.Structures.Model.UI Namespace